test/logs/yyz_test_20250709_1736/benchmark/logs/log_input128_output64_batch32.log
▶️ [2025-07-09 09:37:33] input_len=128, output_len=64, batch_size=32
INFO 07-09 09:37:38 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 07-09 09:37:39 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='deepseek', tokenizer='/home/yuyongzhong/models/DeepSeek-R1-32B', use_beam_search=False, num_prompts=10, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/yuyongzhong/llm-infer/test/logs/yyz_test_20250709_1736/benchmark/logs/result_input128_output64_batch32.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 10/10 [00:04<00:00,  2.14it/s]
============ Serving Benchmark Result ============
Successful requests:                     10        
Benchmark duration (s):                  4.68      
Total input tokens:                      1270      
Total generated tokens:                  640       
Request throughput (req/s):              2.14      
Output token throughput (tok/s):         136.71    
Total Token throughput (tok/s):          407.98    
---------------Time to First Token----------------
Mean TTFT (ms):                          540.31    
Median TTFT (ms):                        540.14    
P99 TTFT (ms):                           542.74    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          65.67     
Median TPOT (ms):                        65.67     
P99 TPOT (ms):                           65.67     
---------------Inter-token Latency----------------
Mean ITL (ms):                           65.67     
Median ITL (ms):                         65.57     
P99 ITL (ms):                            68.69     
==================================================
✅ SUCCESS
---